{
  "name": "Редстоун и автоматизация",
  "icon": "minecraft:redstone",
  "category": "bloodmagic:altar",
  "pages": [
    {
      "type": "text",
      "text": "$(l:bloodmagic:altar/blood_altar)Кровавый алтарь$() фантастическая штука, но стоять и ждать, пока будут изготовлены шиферы, не очень приколько. К счастью, предметы и LP можно автоматически вводить и выводить из алтаря, хотя и с некоторыми оговорками. $(br2)В то время как простая $(item)воронка$() позволяет вам вводить предметы внутрь, алтарь не мешает ему вводить более 1 за раз. Он с радостью создаст 64 шифера за раз,"
    },
    {
      "type": "text",
      "text": "потребляя для этого в 64 раза больше LP, чем обычно, и если вы не можете доставлять LP достаточно быстро, у вас могут возникнуть проблемы. $(br2)Кроме того, алтарь не делает различий между вводом и выводом, поэтому без какого-либо фильтра предметы будут втягиваться и выниматься с такой скоростью, с которой может справиться ваша система передачи предметов. Возможно, вам будет полезно взглянуть на узлы маршрутизации ... (ну, то есть после того, как они будут реализованы :) )"
    },
	{
      "type": "text",
      "text": "Алтарь также поддерживает перенос крови как во внешний резервуар, так и из него. Просто подключите трубку с жидкостью по своему выбору, и вы сможете хранить лишнюю кровь для последующих крафтов. $(br2)Обратите внимание, что по умолчанию скорость передачи очень низкая. Если вы хотите ускорить её, вам лучше будет изучить $(l:bloodmagic:altar/blood_rune/acceleration_rune)руну ускорения$() и $(l:bloodmagic:altar/blood_rune/dislocation_rune)руну смещения$()."
    },
	{
      "type": "text",
      "text": "Не забывайте, что эта кровь берется не из самого алтаря, а из второго, секретного внутреннего резервуара. Этот резервуар может содержать до 10% крови, которую может вместить сам алтарь, поэтому, если числа не складываются в точности или если кровь исчезает из вашего алтаря, вероятно, это то место, куда она идет. Те же ограничения применяются к крови, подаваемой внутрь."
    },
    {
      "type": "text",
      "text": "(Также не реализовано:)) $(strike)Показатель LP кровавого алтаря можно прочитать с помощью компаратора сбоку, как в ванильном сундуке. $(br2)Если вы поместите $(item)Кирпичи Кровавого Камня$()$(strike) под алтарь, компаратор вместо этого прочитает значение $(l:bloodmagic:altar/soul_network)сети душ$(/l) владельца любой сферы, помещенной в алтарь. $(br2)Сила сигнала зависит от размера шара в алтаре, а не от максимального LP сети, поэтому, если у вас есть"
    },
    {
      "type": "text",
      "text": "$(strike)500 000LP, слабый кровавый шар будет отображаться как заполненный только наполовину. Это можно использовать, например, для деактивации определенных ритуалов, если у вас заканчивается LP. $(br2)Наконец, размещение $(item)редстоун лампы$()$(strike) под алтарем заставит ее выдавать сигнал красного камня после завершения операции крафта. Приложив немного хитрости, это должно позволить вам полностью автоматизировать производство шиферов."
    }
  ]
}