{
  "name": "Алтарь благовоний",
  "icon": "bloodmagic:incensealtar",
  "category": "bloodmagic:utility",
  "pages": [
    {
      "type": "text",
      "text": "  $(item)Алтарь благовоний$() это многоблочная структура, которую можно использовать для усиления самопожертвования на $(l:bloodmagic:altar/blood_altar)кровавом алтаре.$(/l) Стоя рядом с вашей установкой, $(item)алтарь благовоний$() успокоит вашу душу в зависимости от общего 'спокойствия' в области, что позволит вам значительно увеличить ваши LP."
    },
    {
      "type": "crafting",
      "recipe": "bloodmagic:incense_altar"
    },
    {
      "type": "text",
      "text": "  Базовая конструкция первого уровня $(item)алтаря блоговоний$() это сам алтарь; поместите его в любом месте (вы можете установить платформу из блоков 3x3, это будет полезно позже) и оставайтесь в радиусе 5 блоков от алтаря.$(br2)  Пока алтарь работает, он будет излучать частицы пламени из себя ввверх и трансформировать ваш $(l:bloodmagic:altar/blood_altar#knife)жервенный нож.$(/l) Как только ваш нож начнет сиять, удерживание и отпускание правой кнопки мыши рядом с алтарем крови принесет в жертву 90% вашего здоровья за раз."
    },
    {
      "type": "image",
      "images": [
        "bloodmagic:images/entries/utility/incense_altar1.png"
      ],
      "title": "Basic Setup",
      "border": true,
      "text": "Basic setup showing the 3x3 square of blocks before the path blocks."
    },
    {
      "type": "text",
      "text": "  Более того, в зависимости от общего cпокойствия в области вы получите бонус к LP, добавленному к алтарю. Наведение курсора на $(item)алтарь благовоний$() с помощью $(l:bloodmagic:alchemy_array/sigil/divination)сигила предсказаний$(/l) или $(l:bloodmagic:alchemy_array/sigil/seer)сигила провидца$() отобразит общее спокойствие сооружения (верхнее число) и процентный бонус, полученный при принесении в жертву (нижнее число). Когда вы жертвуете, вам нужно взять LP, который вы обычно получаете, и умножить его на 1 + бонус / 100."
    },
    {
      "type": "image",
      "images": [
        "bloodmagic:images/entries/utility/incense_altar2.png"
      ],
      "title": "Интерфейс благовоний",
      "border": true,
      "text": "Интерфейс благовоний, по умолчанию в верхнем левом углу, показывая бонус самопожертвования + 20%."
    },
    {
      "type": "text",
      "text": "  \"Но как я могу увеличить этот бонус?\" увеличивая спокойствие в окрестностях! ...Это может быть немного двусмысленно.$(br2)  Чтобы увеличить спокойствие области, вы должны проложить тропу, ведущую из вашего алтаря благовоний. Эти тропы должны быть построены из трех наборов блоков на выбор, таких как $(item)деревянная тропа$(), которые простираются от блоков 3x3 во всех четырех сторонах света."
    },
    {
      "type": "crafting",
      "recipe": "bloodmagic:path/path_wood",
      "recipe2": "bloodmagic:path/path_woodtile"
    },
    {
      "type": "crafting",
      "recipe": "bloodmagic:path/path_stone",
      "recipe2": "bloodmagic:path/path_stonetile"
    },
    {
      "type": "crafting",
      "recipe": "bloodmagic:path/path_wornstone",
      "recipe2": "bloodmagic:path/path_wornstonetile"
    },
    {
      "type": "text",
      "text": "  Каждое новое \"кольцо\" блоков тропы подчиняется набору правил:$(li)Все блоки пути в одном кольце должны находиться на одном уровне.$(li)Следующее кольцо блоков тропы не может быть больше, чем 5 блоков выше / ниже предыдущего кольца.$(li)Блоки, которые находятся на том же уровне или до двух блоков выше кольца блоков тропы учитываются в общем спокойствия - они обозначены стеклянными блоками на картинке."
    },
    {
      "type": "image",
      "images": [
        "bloodmagic:images/entries/utility/incense_altar.png"
      ],
      "title": "Алтарь благовоний",
      "border": true,
      "text": "Алтарь благовоний с разными ориентациями троп."
    },
    {
      "type": "text",
      "text": "Кроме того:$(li)Эффективность каждого типа блока тропы длится только определенное расстояние: деревянные дорожки могут охватывать только три кольца, каменные дорожки пять колец, потёртые каменные дорожки семь колец и обсидиановые дорожки девять колец.$(bn2)  Очевидно, что не каждый тип блока будет засчитываться для поднятия спокойствия. Не просто булыжник, нет! Вам нужны посевы, грязь и даже ... лава?"
    },
    {
      "type": "text",
      "text": "  Есть несколько типов блоков, которые учитываются в общем спокойствии. В произвольном порядке это: растения, культуры, деревья, земля, вода, огонь и лава. Алтарь благовоний будет учитывать все блоки, которые находятся в пределах его диапазона (установленного блоками тропы), и подсчитывать, сколько всего существует спокойствия каждого типа. После этого он рассчитает общее спокойствие путем извлечения квадратного корня из спокойствия каждого типа и последующего сложения их вместе."
    },
    {
      "type": "text",
      "text": "Это означает, что для более поздних построек лучше всего иметь много разных типов спокойствия. Хотя другие моды могут добавлять свои собственные, и другие будут добавлены позже. Блоки, которые способствуют успокоению: лава, вода, жизненная эссенция, адский камень, грязь, поля, картофель, морковь, пшеница, адский нарост, свекла, листья, бревна, огонь и трава."
    },
    {
      "type": "image",
      "images": [
        "bloodmagic:images/entries/utility/incense_altar3.png"
      ],
      "title": "Настройка алтаря благовоний",
      "border": true,
      "text": "Установка алтаря благовоний для более поздней игры с множеством разных уровней."
    },
    {
      "type": "text",
      "text": "Конечно, ваша установка может быть как превосходной как и невероятной (в пределах разумного, как описано ранее в этой записи). $(br2) Важно отметить, что бонус к спокойствию ограничен размером вашего алтаря (и, следовательно, уровнем тропы, которую вы используете). Ограничения следующие: $(li) Без тропы: 20%. $(li) Деревянная тропа: 60%. $(li) Каменная тропа: 120%. $(li) Потёртая каменная тропа: 200%. $(li) Обсидиановая тропа: 300%. (к сожалению, обсидиановая тропа еще не реализована)"
    },
    {
      "type": "image",
      "images": [
        "bloodmagic:images/entries/utility/incense_altar4.png"
      ],
      "title": "Настройка алтаря благовоний",
      "border": true,
      "text": "Очень простой алтарь для благовоний. Обратите внимание на (необязательное) смешивание разных блоков тропы."
    }
  ]
}