{
  "name": "Основа Алхимических Массивов",
  "icon": "bloodmagic:arcaneashes",
  "category": "bloodmagic:alchemy_array/functional_array",
  "extra_recipe_mappings":[["bloodmagic:arcaneashes", 1]],
  "pages": [
    {
      "type": "text",
      "text": "$(item)Чародейский пепел$() это предмет, который играет ключевую роль в создании Алхимических Массивов. $(item)Чародейский пепел$() можно создать на $(l:bloodmagic:alchemy_table/alchemy_table)Алхимическом Столе$() используя более ранние игровые предметы."
    },
    {
      "type": "crafting_alchemy_table",
      "heading": "Чародейский пепел",
      "recipe": "bloodmagic:alchemytable/arcane_ash"
    },
    {
      "type": "text",
      "text": "Чтобы создать Алхимический Массив, щелкните правой кнопкой мыши по верхней части земли с помощью $(item)Чародейского Пепла$() (хотя работает любая грань блока) - это потребует 1 прочность из 20 от $(item)Чародейского Пепла$() и нарисуйте простой Алхимический Массив, который сам по себе не имеет никакого эффекта. $(Bl2) Когда вы нажимаете на Алхимический Массив, он поглощает один элемент из стека в вашей руке и удерживает его в массиве. Затем эти предметы используются для определения эффекта Алхимического Массива. "
    },
    {
      "type": "image",
      "images": [
        "bloodmagic:images/entries/alchemy_array/simple_array.png",
        "bloodmagic:images/entries/alchemy_array/divination_array_1.png",
        "bloodmagic:images/entries/alchemy_array/divination_array_2.png"
      ],
      "title": "Алхимический Массив",
      "border": true,
      "text": "Алхимический Массив, показывает массив: без входов; только базовый элемент; как основа, так и катализатор."
    },
    {
      "type": "text",
      "text": "Для каждого эффекта требуется два предмета: база и катализатор. База - это первый элемент, которым вы щелкаете по массиву после его рисования, а катализатор - второй элемент. Когда вы применяете ввод, дизайн массива изменится, если он корректен, массив начнет активироваться, как только вы примените катализатор. $(Br2) Хотя в настоящее время реализовано только несколько массивов, в конечном итоге у вас будут массивы всех диапазонов, от простых $(l:bloodmagic:alchemy_array/crafting_array)Массив Создания$(/l) до массивов телепортации ."
    }
  ]
}
