{
  "name": "Ритуалы - начало",
  "icon": "bloodmagic:activationcrystalcreative",
  "category": "bloodmagic:rituals",
  "priority": "true",
  "pages": [
    {
      "type": "text",
      "text": "Как только вы улучшите свой $(l:bloodmagic:altar/blood_altar)кровавый алтарь$(/l) до третьего уровня, вы сможете окунуться в чудесный мир ритуалов. $(br2)Для работы с ритуалами вам потребуется следующее: $(li)$(l:bloodmagic:rituals/activation_crystals)кристалл активации$(). На уровне 3 доступен только $(item)слабый кристалл$(). $(li) $(item)Главный ритуальный камень$(). Каждый ритуал требует ровно одного из них в центре." 
    },
    {
      "type": "text",
      "text": "$(li)Достаточно ритуальных камней для построения ритуала. $(li)(рекомендуется) $(l:bloodmagic:rituals/ritual_diviner)предсказатель ритуалов$(). Хотя это и не обязательно, это значительно облегчит построение ритуала. $(br2)Создание ритуала относительно несложно. Просто нажмите Shift и щёлкните с предсказателем в руке, пока он не отобразит название желаемого ритуала. Проверьте количество требуемых рун, наведя указатель мыши на" 
    },
    {
      "type": "text",
      "text": "инвентарь и удерживая shift. $(br2)Поставьте главный ритуальный камень и удерживайте правую кнопку мыши, пока все камни не будут размещены и раскрашены правильным элементом. Наконец, щелкните правой кнопкой мыши главный камень своим кристаллом активации. Если вы все сделали правильно, вы должны получить сообщение «Прилив энергии проходит через ритуал!». Ритуал активен." 
    },
    {
      "type": "text",
      "text": "Если этого не происходит, возможно, что-то пошло не так. Если вместо этого вы получаете сообщение «Вы чувствуете толчок, но слишком слабы, чтобы завершить этот ритуал», значит, у вас недостаточно LP в вашей Сети Души, чтобы активировать ритуал. $(br2) Если сообщение гласит: «Вы чувствуете, что эти руны настроены неправильно ...», значит, что-то пошло не так с размещением рун. Проверьте зону на наличие засоров (например, травы, камня и т.д.), и повторите попытку." 
    },
    {
      "type": "text",
      "text": "Помните, что некоторые ритуалы проходят на несколько блоков выше и ниже главного ритуального камня. Если вы не получили ошибки, убедитесь, что кристалл активации привязан к вашей сети душ - это можно сделать, щелкнув по нему правой кнопкой мыши. $(br2) Важно отметить, что кристалл не обязательно должен быть привязан к ВАШЕЙ сети - если вы можете завладеть кристаллом другого игрока, вы можете активировать ритуалы, используя их запас крови. Охраняйте свои запасы!"
    },
    {
      "type": "text",
      "text": "Одна последняя заметка; все ритуалы реагируют на сигнал $(item)красного камня$(), поэтому прикрепление рычага сбоку от главного ритуального камня - хороший способ его деактивировать. Вы можете объединить эти знания с некоторой информацией в $(l:bloodmagic:altar/redstone_automation)Редстоун и автоматизация$() чтобы гарантировать автоматическое отключение ваших ритуалов задолго до того, как ваша сеть душ иссякнет."
    }
  ]
}